_posts/2015-01-18-org-mode-and-jekyll.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. branch master on </a></li>
<li><a href="#sec-2">2. jekyll on windows</a></li>
</ul>
</div>
</div>
---
---
layout: default
title: emacs org mode和jekyll
excerpt: ???
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> branch master on <a href="http://georgealbert.github.io">http://georgealbert.github.io</a></h2>
<div class="outline-text-2" id="text-1">
<p>
直接用master这种方式，<sub>config</sub>.yaml的baseurl为 =""= 。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> jekyll on windows</h2>
<div class="outline-text-2" id="text-2">
<p>
在 <a href="http://jekyllrb.com/docs/installation/">http://jekyllrb.com/docs/installation/</a> 上看见windows的支持不给力，我还是暴力手写吧，先看看效果。
</p>
<pre class="example">
Running Jekyll on Windows
While Windows is not officially supported, it is possible to get it running on Windows. Special instructions can be found on our Windows-specific docs page.
</pre>
</div>
</div>
